SQL과 함수

목 차

01. COUNT

02. LIMIT

03. SUM & AVG

04. MAX & MIN

< 함수 >

1. 데이터 값을 계산하거나 조작 : 행 함수

2. 행의 그룹을 계산하거나 요약 : 그룹 함수

3. 열의 데이터 타입을 변환

01. COUNT

데이터가 몇 개인지 궁금하다면?

엘리스 도서관의 사서인 도도새는 문득 우리 도서관의 책이
모두 몇 개일까 궁금해졌다.

책 정보를 저장하는 book테이블에서 
전체 책 수를 조회해보자.

데이터의 개수를 확인했을 때

book테이블
    id      title     author           publisher
    1       어린왕자   생텍쥐페리         엘리스 출판
    2       돈키호테   미겔데세르반테스    엘리스 출판
    3       햄릿      윌리엄셰익스피어    엘리스 출판
    
    
카운트
  3

COUNT

검색한 결과의 데이터의 개수를 가져오는 내장함수

NULL인 데이터는 제외(데이터가 없음 빈 공간)

ex) 1 2 0 3 -> count 4
ex) 1 2   3 -> count 3

COUNT 기본 문법

Example
SELECT COUNT(id) FROM book;
명령    검색할 컬럼

book 테이블 안에 있는 id컬럼의 개수를 검색

- SELECT + COUNT( 컬럼 ) FROM 테이블 이름;

COUNT 기본 문법

Example
SELECT COUNT(*) FROM book;
명령    검색할 컬럼

검색할 데이터에 *을 입력하면 모든 데이터 검색
- COUNT(*) -> 모든 컬럼 데이터 갯수

데이터의 숫자 세어보기 - COUNT 1
도서관의 전체 책의 수와 회원 수를 조회해 봅시다.

하지만 SELECT를 통해 전체를 출력하고 세어보는 것은 위험합니다. 특히 개수가 많다면 중간에 실수할 가능성이 높습니다.

따라서 앞서 배운 COUNT 함수를 이용해 조회하도록 합시다.


지시사항
book 테이블을 COUNT함수와 *을 이용해 조회해 봅시다.
user 테이블을 COUNT함수와 *을 이용해 조회해 봅시다.

In [ ]:
'''
-- 아래에 book테이블의 자료의 수와 user테이블의 자료의 수를 차례대로 조회해 봅시다.
SELECT * FROM user;
SELECT * FROM book;

SELECT COUNT(*) FROM user; -- 4
SELECT COUNT(*) FROM book; -- 5
'''

'''
+------+-------------+-----------------------+---------------+------------------+
| id   | name        | email                 | phone         | address          |
+------+-------------+-----------------------+---------------+------------------+
| 1000 | Elice       | elice@elice.com       | 010-1234-5678 | 101-23 CeileDong |
| 1001 | Cheshire    | cheshire@elice.com    | 010-8765-4321 | 101-24 CeileDong |
| 1002 | Dodo        | dodo@elice.com        | 010-1111-2222 | 100-11 CeileDong |
| 1003 | Caterpillar | caterpillar@elice.com | 010-1212-3434 | 100-12 CeileDong |
+------+-------------+-----------------------+---------------+------------------+
+------+------------------------------------------+------------------------------+-----------------------+---------------+
| id   | title                                    | author                       | publisher             | date_received |
+------+------------------------------------------+------------------------------+-----------------------+---------------+
| 1000 | Romeo and Juliet                         | William Shakespeare          | NULL                  | 2012-04-01    |
| 1001 | Don Quixote                              | Miguel de Cervantes Saavedra | NULL                  | 2015-03-31    |
| 1002 | The Little Prince                        | Antoine de Saint-Exupery     | NULL                  | 2018-12-21    |
| 1003 | Harry Potter and the Philosopher's Stone | Joanne Kathleen Rowling      | Bloomsbury Publishing | 2017-06-26    |
| 1004 | The Lord of the Rings                    | John Ronald Reuel Tolkien    | Allen & Unwin         | 2014-07-29    |
+------+------------------------------------------+------------------------------+-----------------------+---------------+
+----------+
| COUNT(*) |
+----------+
|        4 |
+----------+
+----------+
| COUNT(*) |
+----------+
|        5 |
+----------+
코드 실행이 완료되었습니다.
'''

데이터의 숫자 세어보기 - COUNT 2
직원의 전체 수를 검색해봅시다.

하지만 SELECT를 통해 전체를 출력하고 세어보는 것은 위험합니다. 특히 개수가 많다면 중간에 실수할 가능성이 높습니다.

따라서 앞서 배운 COUNT 함수를 이용해 검색하도록 합시다.


지시사항
employees 테이블을 COUNT함수와 *을 이용해 검색해봅시다.

In [ ]:
'''
-- employees테이블의 자료의 수를 조회해 봅시다.
desc employees;
SELECT COUNT(*) FROM employees;
'''

'''
+-------------+---------------+------+-----+---------+-------+
| Field       | Type          | Null | Key | Default | Extra |
+-------------+---------------+------+-----+---------+-------+
| emp_no      | int(11)       | NO   | PRI | NULL    |       |
| birth_date  | date          | NO   |     | NULL    |       |
| first_name  | varchar(14)   | NO   |     | NULL    |       |
| last_name   | varchar(16)   | NO   |     | NULL    |       |
| gender      | enum('M','F') | NO   |     | NULL    |       |
| hire_date   | date          | NO   |     | NULL    |       |
| superior_no | int(11)       | YES  | MUL | NULL    |       |
+-------------+---------------+------+-----+---------+-------+
+----------+
| COUNT(*) |
+----------+
|       52 |
+----------+
'''

02. LIMIT

데이터의 일부만 보고 싶다면?

엘리스 도서관의 사서 도도새는 book테이블에서 모든 책을 조회했다.
그랬더니 수 많은 책 정보가 출력되었다.
정보가 너무 많아 헷갈린 도도새는 이 중 3권만 보고 싶어졌다.
어떻게 3권만 출력할 수 있을까?

책을 3권만 조회했을 때

book테이블
id title          author        publisher      
1  어린왕자        생텍쥐페리      엘리스 출판
2  돈키호테        미겔데세르반테스 엘리스 출판
3  햄릿           윌리엄셰익스피어 엘리스 출판
4  로미오와 줄리엣  윌리엄셰익스피어 엘리스 출판
5  해리포터        조엔 케이 롤링  엘리스 출판



LIMIT3


id title          author        publisher
1  어린왕자        생텍쥐페리      엘리스 출판
2  돈키호테        미겔데세르반테스 엘리스 출판
3  햄릿           윌리엄셰익스피어 엘리스 출판

LIMIT

테이블에서 출력하고자 하는 데이터의 개수를 제한하는 명령

LIMIT 기본 문법

Example
-- book 테이블에서 데이터를 5개만 가져오기
SELECT * FROM book LIMIT 5;
명령                제한할숫자
-- 2번째 데이터부터 5개를 가져오기
SELECT * FROM book LIMIT 1, 5;
명령                제한할숫자


첫 번째 컬럼의 시작은 0

즉, 'LIMIT 1, 5'는 2번째 컬럼(행)부터 5개를 가져오라는 의미

데이터에서 상단 값만 출력하기 - LIMIT 1
엘리스 도서관에 책이 몇 권 더 추가로 들어왔습니다.

이제 도서관에는 책을 한 번에 조회하면 알아볼 수 없을 정도로 많아졌습니다.

혼란스러운 엘리스를 위해 SELECT문 뒤에 LIMIT를 덧붙여 책 정보 5개만을 조회해보세요!


지시사항
book테이블에서 LIMIT를 덧붙여 책 정보 5개만을 조회해보세요.
출력할 때는 모든 컬럼을 조회하도록 합시다.

In [ ]:
'''
-- book테이블의 모든 컬럼을 조회해 봅시다. 단 5권만 잘라서 출력해야 합니다.
DESC book;


SELECT * FROM book LIMIT 5;
'''

'''
+---------------+-------------+------+-----+---------+-------+
| Field         | Type        | Null | Key | Default | Extra |
+---------------+-------------+------+-----+---------+-------+
| id            | varchar(32) | NO   | PRI | NULL    |       |
| title         | varchar(64) | NO   |     | NULL    |       |
| author        | varchar(16) | YES  |     | NULL    |       |
| publisher     | varchar(32) | YES  |     | NULL    |       |
| date_received | date        | YES  |     | NULL    |       |
+---------------+-------------+------+-----+---------+-------+
+------+------------------------------------------+------------------+-----------------------+---------------+
| id   | title                                    | author           | publisher             | date_received |
+------+------------------------------------------+------------------+-----------------------+---------------+
| 1000 | Romeo and Juliet                         | William Shakespe | NULL                  | 2012-04-01    |
| 1001 | Don Quixote                              | Miguel de Cervan | NULL                  | 2015-03-31    |
| 1002 | The Little Prince                        | Antoine de Saint | NULL                  | 2018-12-21    |
| 1003 | Harry Potter and the Philosopher's Stone | Joanne Kathleen  | Bloomsbury Publishing | 2017-06-26    |
| 1004 | The Lord of the Rings                    | John Ronald Reue | Allen & Unwin         | 2014-07-29    |
+------+------------------------------------------+------------------+-----------------------+---------------+
코드 실행이 완료되었습니다.
'''

데이터에서 상단 값만 출력하기 - LIMIT 2
salaries 테이블에는 직원들의 연도별 연봉이 들어있습니다.

회사가 오래 유지되면서 연봉을 한 번에 조회하면 알아볼 수 없을 정도로 많아졌습니다.

혼란을 방지하기 위해 SELECT문 뒤에 LIMIT를 덧붙여 연봉 정보 5개만을 검색해보세요!


지시사항
salaries 테이블에서 SELECT문 뒤에 LIMIT를 덧붙여 연봉 정보 5개만을 검색해보세요.
검색할 때는 모든 컬럼을 검색하도록 합니다.

In [ ]:
'''
-- salaries테이블의 모든 컬럼을 조회해 봅시다. 단 5개만 잘라서 출력해야 합니다.
desc salaries;

select * from salaries;

select * from salaries limit 5;
'''

'''
+-----------+---------+------+-----+---------+-------+
| Field     | Type    | Null | Key | Default | Extra |
+-----------+---------+------+-----+---------+-------+
| emp_no    | int(11) | NO   |     | NULL    |       |
| salary    | int(11) | NO   |     | NULL    |       |
| from_date | date    | NO   |     | NULL    |       |
| to_date   | date    | NO   |     | NULL    |       |
+-----------+---------+------+-----+---------+-------+
+--------+--------+------------+------------+
| emp_no | salary | from_date  | to_date    |
+--------+--------+------------+------------+
|  10001 |  62102 | 1987-06-26 | 1988-06-25 |
|  10001 |  66074 | 1988-06-25 | 1989-06-25 |
|  10001 |  66596 | 1989-06-25 | 1990-06-25 |
|  10001 |  66961 | 1990-06-25 | 1991-06-25 |
|  10001 |  71046 | 1991-06-25 | 1992-06-24 |
|  10001 |  74333 | 1992-06-24 | 1993-06-24 |
|  10001 |  76884 | 1995-06-24 | 1996-06-23 |
|  10001 |  80013 | 1996-06-23 | 1997-06-23 |
|  10001 |  81025 | 1997-06-23 | 1998-06-23 |
|  10001 |  81097 | 1998-06-23 | 1999-06-23 |
|  10001 |  84917 | 1999-06-23 | 2000-06-22 |
|  10002 |  65828 | 1996-08-03 | 1997-08-03 |
|  10002 |  65909 | 1997-08-03 | 1998-08-03 |
|  10002 |  67534 | 1998-08-03 | 1999-08-03 |
|  10002 |  69366 | 1999-08-03 | 2000-08-02 |
|  10002 |  71963 | 2000-08-02 | 2001-08-02 |
|  10002 |  72527 | 2001-08-02 | 9999-01-01 |
|  10003 |  40006 | 1995-12-03 | 1996-12-02 |
|  10003 |  43616 | 1996-12-02 | 1997-12-02 |
|  10003 |  43311 | 2001-12-01 | 9999-01-01 |
|  10004 |  40054 | 1986-12-01 | 1987-12-01 |
|  10004 |  42283 | 1987-12-01 | 1988-11-30 |
|  10004 |  42542 | 1988-11-30 | 1989-11-30 |
|  10004 |  46065 | 1989-11-30 | 1990-11-30 |
|  10004 |  58326 | 1994-11-29 | 1995-11-29 |
|  10004 |  60770 | 1995-11-29 | 1996-11-28 |
|  10004 |  62566 | 1996-11-28 | 1997-11-28 |
|  10004 |  64340 | 1997-11-28 | 1998-11-28 |
|  10004 |  67096 | 1998-11-28 | 1999-11-28 |
|  10004 |  69722 | 1999-11-28 | 2000-11-27 |
|  10004 |  70698 | 2000-11-27 | 2001-11-27 |
|  10004 |  74057 | 2001-11-27 | 9999-01-01 |
|  10005 |  78228 | 1989-09-12 | 1990-09-12 |
|  10005 |  82621 | 1990-09-12 | 1991-09-12 |
|  10005 |  88063 | 1996-09-10 | 1997-09-10 |
|  10005 |  89724 | 1997-09-10 | 1998-09-10 |
|  10005 |  90392 | 1998-09-10 | 1999-09-10 |
|  10005 |  90531 | 1999-09-10 | 2000-09-09 |
|  10005 |  91453 | 2000-09-09 | 2001-09-09 |
|  10005 |  94692 | 2001-09-09 | 9999-01-01 |
|  10006 |  40000 | 1990-08-05 | 1991-08-05 |
|  10006 |  42085 | 1991-08-05 | 1992-08-04 |
|  10006 |  42629 | 1992-08-04 | 1993-08-04 |
|  10006 |  45844 | 1993-08-04 | 1994-08-04 |
|  10006 |  47518 | 1994-08-04 | 1995-08-04 |
|  10006 |  47917 | 1995-08-04 | 1996-08-03 |
|  10006 |  52255 | 1996-08-03 | 1997-08-03 |
|  10006 |  53747 | 1997-08-03 | 1998-08-03 |
|  10007 |  62745 | 1991-02-10 | 1992-02-10 |
|  10007 |  63475 | 1992-02-10 | 1993-02-09 |
|  10007 |  63208 | 1993-02-09 | 1994-02-09 |
|  10007 |  64563 | 1994-02-09 | 1995-02-09 |
+--------+--------+------------+------------+
+--------+--------+------------+------------+
| emp_no | salary | from_date  | to_date    |
+--------+--------+------------+------------+
|  10001 |  62102 | 1987-06-26 | 1988-06-25 |
|  10001 |  66074 | 1988-06-25 | 1989-06-25 |
|  10001 |  66596 | 1989-06-25 | 1990-06-25 |
|  10001 |  66961 | 1990-06-25 | 1991-06-25 |
|  10001 |  71046 | 1991-06-25 | 1992-06-24 |
+--------+--------+------------+------------+
코드 실행이 완료되었습니다.
'''

03. SUM & AVG

SUM

지정한 컬럼들의 값을 모두 더하여
총점을 구해주는 내장함수

AVG

지정한 컬럼들의 평균값을 구해주는 내장함수

학생들의 총점을 구하고 싶다면?

엘리스 토끼 선생님은 이번 중간고사에서
학생들의 수학 점수를 모두 더한 총점을 찾고 싶다.
점수를 일일이 보며 더하기에는 귀찮은데
데이터를 모두 더해서 출력하는 방법은 없을까?

수학점수의 총합을 구했을 때

grade테이블
    name   korean    english   math
    엘리스   100       80       60
    체셔     100       50       60
    도도새    90       90       100
    
SUM(math)
    220

SUM

지정한 컬럼들의 값을 모두 더하여
총점을 구해주는 내장함수

SUM 기본 문법

Example
SELECT SUM(math) FROM grade;
명령    검색할 컬럼


SUM을 이용해 원하는 데이터의 합을 구할 수 있다.

컬럼을 기준으로 데이터를 불러오느냐? - SELECT
조건이 되느냐?  - WHERE

SUM/COUNT를 사용하지 않고 평균 구하기

엘리스 토끼 선생님은 이번 중간고사에서 학생들의
점수를 모두 더한 총점을 구하는데 성공했다.
이제 반 평균을 구하고 싶은데
어떻게 평균을 쉽게 구할 수 있을까?

각 과목의 평균을 구했을 때

grade테이블
    name   korean    english   math
    엘리스   100       80       60
    체셔     100       50       60
    도도새    90       90       100 
    
AVG

AVG(korean)   AVG(english)   AVG(math)   
96.6667       73.3333        73.3333

AVG

지정한 컬럼들의 평균값을 구해주는 내장함수

AVG 기본 문법

Example

SELECT AVG(korean), AVG(english), AVG(math) FROM grade;
명령    -----------------------------------
                 평균을 구할 컬럼
                 
- 원하는 데이터의 평균을 구할 수 있다.

데이터들의 합 구하기 - SUM
salaries 테이블에서 지금까지 지급되었던 연봉액(salary)에 대한 합을 계산하려고 합니다.

SUM함수를 이용해서 구해보세요.


지시사항
salaries 테이블에서 salary의 합을 구해서 검색해봅시다.

In [ ]:
'''
-- salary테이블의 연봉의 합을 구해봅시다.
DESC salaries ;

select * from salaries;

select SUM(salary) from salaries;
'''

'''
+-----------+---------+------+-----+---------+-------+
| Field     | Type    | Null | Key | Default | Extra |
+-----------+---------+------+-----+---------+-------+
| emp_no    | int(11) | NO   |     | NULL    |       |
| salary    | int(11) | NO   |     | NULL    |       |
| from_date | date    | NO   |     | NULL    |       |
| to_date   | date    | NO   |     | NULL    |       |
+-----------+---------+------+-----+---------+-------+
+--------+--------+------------+------------+
| emp_no | salary | from_date  | to_date    |
+--------+--------+------------+------------+
|  10001 |  62102 | 1987-06-26 | 1988-06-25 |
|  10001 |  66074 | 1988-06-25 | 1989-06-25 |
|  10001 |  66596 | 1989-06-25 | 1990-06-25 |
|  10001 |  66961 | 1990-06-25 | 1991-06-25 |
|  10001 |  71046 | 1991-06-25 | 1992-06-24 |
|  10001 |  74333 | 1992-06-24 | 1993-06-24 |
|  10001 |  76884 | 1995-06-24 | 1996-06-23 |
|  10001 |  80013 | 1996-06-23 | 1997-06-23 |
|  10001 |  81025 | 1997-06-23 | 1998-06-23 |
|  10001 |  81097 | 1998-06-23 | 1999-06-23 |
|  10001 |  84917 | 1999-06-23 | 2000-06-22 |
|  10002 |  65828 | 1996-08-03 | 1997-08-03 |
|  10002 |  65909 | 1997-08-03 | 1998-08-03 |
|  10002 |  67534 | 1998-08-03 | 1999-08-03 |
|  10002 |  69366 | 1999-08-03 | 2000-08-02 |
|  10002 |  71963 | 2000-08-02 | 2001-08-02 |
|  10002 |  72527 | 2001-08-02 | 9999-01-01 |
|  10003 |  40006 | 1995-12-03 | 1996-12-02 |
|  10003 |  43616 | 1996-12-02 | 1997-12-02 |
|  10003 |  43311 | 2001-12-01 | 9999-01-01 |
|  10004 |  40054 | 1986-12-01 | 1987-12-01 |
|  10004 |  42283 | 1987-12-01 | 1988-11-30 |
|  10004 |  42542 | 1988-11-30 | 1989-11-30 |
|  10004 |  46065 | 1989-11-30 | 1990-11-30 |
|  10004 |  58326 | 1994-11-29 | 1995-11-29 |
|  10004 |  60770 | 1995-11-29 | 1996-11-28 |
|  10004 |  62566 | 1996-11-28 | 1997-11-28 |
|  10004 |  64340 | 1997-11-28 | 1998-11-28 |
|  10004 |  67096 | 1998-11-28 | 1999-11-28 |
|  10004 |  69722 | 1999-11-28 | 2000-11-27 |
|  10004 |  70698 | 2000-11-27 | 2001-11-27 |
|  10004 |  74057 | 2001-11-27 | 9999-01-01 |
|  10005 |  78228 | 1989-09-12 | 1990-09-12 |
|  10005 |  82621 | 1990-09-12 | 1991-09-12 |
|  10005 |  88063 | 1996-09-10 | 1997-09-10 |
|  10005 |  89724 | 1997-09-10 | 1998-09-10 |
|  10005 |  90392 | 1998-09-10 | 1999-09-10 |
|  10005 |  90531 | 1999-09-10 | 2000-09-09 |
|  10005 |  91453 | 2000-09-09 | 2001-09-09 |
|  10005 |  94692 | 2001-09-09 | 9999-01-01 |
|  10006 |  40000 | 1990-08-05 | 1991-08-05 |
|  10006 |  42085 | 1991-08-05 | 1992-08-04 |
|  10006 |  42629 | 1992-08-04 | 1993-08-04 |
|  10006 |  45844 | 1993-08-04 | 1994-08-04 |
|  10006 |  47518 | 1994-08-04 | 1995-08-04 |
|  10006 |  47917 | 1995-08-04 | 1996-08-03 |
|  10006 |  52255 | 1996-08-03 | 1997-08-03 |
|  10006 |  53747 | 1997-08-03 | 1998-08-03 |
|  10007 |  62745 | 1991-02-10 | 1992-02-10 |
|  10007 |  63475 | 1992-02-10 | 1993-02-09 |
|  10007 |  63208 | 1993-02-09 | 1994-02-09 |
|  10007 |  64563 | 1994-02-09 | 1995-02-09 |
+--------+--------+------------+------------+
+-------------+
| SUM(salary) |
+-------------+
|     3381317 |
+-------------+
코드 실행이 완료되었습니다.
'''

데이터들의 평균 구하기 - AVG 1
grade 테이블 안에는 이번 중간고사에서 본 성적이 들어 있습니다.

이 테이블을 이용해 과목별 평균점수를 구해봅시다.

이번에도 직접 계산하는 것은 어려우니 AVG함수를 이용해 봅시다.


지시사항
grade 테이블에서 모든 국어 점수의 평균, 모든 영어 점수의 평균, 모든 수학 점수의 평균 총 세개의 값을 구해봅시다.
국어, 영어, 수학 순서로 하나의 SELECT문을 이용해 조회합니다.

In [ ]:
'''
-- 학생들의 성적이 담겨있는 테이블의 구조를 조회합니다. 수정하실 필요는 없습니다.
DESC grade;

-- 학생들의 성적의 평균을 조회합니다.
select avg(korean), avg(english), avg(math) from grade;
'''

'''
+---------+-------------+------+-----+---------+-------+
| Field   | Type        | Null | Key | Default | Extra |
+---------+-------------+------+-----+---------+-------+
| id      | int(11)     | NO   | PRI | NULL    |       |
| name    | varchar(32) | NO   |     | NULL    |       |
| korean  | int(11)     | YES  |     | NULL    |       |
| english | int(11)     | YES  |     | NULL    |       |
| math    | int(11)     | YES  |     | NULL    |       |
+---------+-------------+------+-----+---------+-------+
+-------------+--------------+-----------+
| avg(korean) | avg(english) | avg(math) |
+-------------+--------------+-----------+
|     85.7143 |      77.1429 |   78.5714 |
+-------------+--------------+-----------+
코드 실행이 완료되었습니다.
'''

데이터들의 평균 구하기 - AVG 2
salaries 테이블에는 지금까지 직원들에게 지급되었던 연봉액(salary)에 대한 정보가 들어 있습니다.

이 테이블을 이용해 평균 연봉을 구해봅시다.

이번에도 직접 계산하는 것은 어려우니 AVG 함수를 이용해 봅시다.


지시사항
salaries 테이블에서 salary의 평균을 구해서 검색해봅시다.

In [ ]:
'''
-- salary테이블의 연봉의 평균을 구해봅시다.

select avg(salary) from salaries;
'''

'''
+-------------+
| avg(salary) |
+-------------+
|  65025.3269 |
+-------------+
코드 실행이 완료되었습니다.

'''

04. MAX & MIN

가장 높은 점수를 찾고 싶다면?

엘리스 토끼 선생님은 이번 중간고사에서
국어 성적 1등을 찾고 싶다.
grade 테이블에 저장된 국어 점수 중에서
가장 높은 점수가 몇 점인지 어떻게 찾을 수 있을까?

가장 높은 국어 점수를 구했을 때

grade테이블
name   korean   english  math
엘리스   100       80       60
　체셔   100       50       60
도도새    90       90      100

MAX(korean)
100

MAX

테이블에 존재하는 데이터에서 최대값을 가져오는 내장함수
(숫자형 뿐만 아니라 문자형도 가능)

MAX 기본문법

Example

SELECT MAX(korean) FROM grade;
명령    검색할 컬럼    

원하는 데이터의 최댓값을 구할 수 있다.

가장 낮은 점수를 찾고 싶다면?

이번엔 반대로 영어 점수 중에서
가장 낮게 받은 점수가 몇 점인지 찾고 싶다.
grade 테이블에 저장된 영어 점수 중에서
가장 낮은 점수가 몇 점인지 어떻게 찾을 수 있을까?

가장 낮은 영어 점수를 구했을 때

grade테이블
name   korean   english  math
엘리스   100       80       60
　체셔   100       50       60
도도새    90       90      100

MIN(english)
50

MIN

테이블에 존재하는 데이터에서 최솟값을 가져오는 함수
(숫자형뿐만 아니라 문자형도 가능)

MIN 기본문법

Example

SELECT MIN(english) FROM grade;
명령    검색할 컬럼

원하는 데이터의 최솟값을 구할 수 있다.

데이터에서 최대값 찾기 - MAX 1
이번 국어시험은 아주 어려웠습니다

그래서 엘리스는 100점을 맞은 친구가 없을 거라 생각했습니다.

그 생각이 맞았는지 확인하기 위해 국어시험에서 가장 높은 점수가 몇 점이었는지 조회해 봅시다.

SELECT문에 MAX함수를 이용해 조회하면 됩니다.


지시사항
국어시험에서 가장 높은 점수가 몇 점이었는지 student테이블에서 조회해보세요.
student테이블의 각 컬럼은 다음과 같습니다.

In [ ]:
'''
-- 학생들의 성적이 담겨있는 테이블의 구조를 조회합니다. 수정하실 필요는 없습니다.
DESC student;

-- 가장 높은 국어성적을 조회합니다.
SELECT MAX(korean) from student;
'''
# 
'''
+---------+-------------+------+-----+---------+-------+
| Field   | Type        | Null | Key | Default | Extra |
+---------+-------------+------+-----+---------+-------+
| name    | varchar(32) | NO   | PRI | NULL    |       |
| korean  | int(11)     | YES  |     | NULL    |       |
| english | int(11)     | YES  |     | NULL    |       |
| math    | int(11)     | YES  |     | NULL    |       |
+---------+-------------+------+-----+---------+-------+
+-------------+
| MAX(korean) |
+-------------+
|         100 |
+-------------+
'''

데이터에서 최대값 찾기 - MAX 2
가장 많은 연봉액이 얼마인지 검색해봅시다.

SELECT문에 MAX함수를 이용해 검색하면 됩니다.


지시사항
salaries테이블에서 MAX함수를 이용해 가장 많은 연봉액(salary)을 구해봅시다.

In [ ]:
'''
-- 가장 많은 연봉액을 구해봅시다.
desc salaries;
select max(salary) from salaries;
'''

'''
+-----------+---------+------+-----+---------+-------+
| Field     | Type    | Null | Key | Default | Extra |
+-----------+---------+------+-----+---------+-------+
| emp_no    | int(11) | NO   |     | NULL    |       |
| salary    | int(11) | NO   |     | NULL    |       |
| from_date | date    | NO   |     | NULL    |       |
| to_date   | date    | NO   |     | NULL    |       |
+-----------+---------+------+-----+---------+-------+
+-------------+
| max(salary) |
+-------------+
|       94692 |
+-------------+
코드 실행이 완료되었습니다.
'''

데이터에서 최소값 찾기 - MIN
이번엔 반대로 가장 적은 연봉액이 얼마인지 조회해 봅시다.

SELECT문에 MIN함수를 이용해 검색하면 됩니다.


지시사항
salaries테이블에서 MIN함수를 이용해 가장 적은 연봉액(salary)을 구해봅시다.

In [ ]:
'''
-- 가장 적은 연봉액을 구해봅시다.
select min(salary) from salaries;
'''
'''
+-------------+
| min(salary) |
+-------------+
|       40000 |
+-------------+
코드 실행이 완료되었습니다.
'''

SQL과 함수
3장을 마친 여러분! 오늘도 수고하셨어요 🤓
여러 함수를 배운 만큼 헷갈리기 쉽겠죠?
지금 바로 복습 시작해 봅시다~



1. COUNT
COUNT: 검색한 데이터의 개수를 가져오는 내장함수 (NULL인 데이터는 제외)

Point I

SELECT COUNT(id) FROM book;
book 테이블 안에 있는 id 컬럼의 개수를 검색
Point II

SELECT COUNT(*) FROM book;
검색할 테이터에 *을 입력하면 모든 데이터 검색


2. LIMIT
LIMIT: 테이블에서 출력하고자 하는 데이터의 개수를 제한하는 명령어

Point I

SELECT * FROM book  LIMIT 5; --제한할 숫자
book 테이블에서 데이터를 5개만 가져오기
Point II

SELECT * FROM book LIMIT 1, 5;
첫 번째 행의 시작은 0
LIMIT 1, 5는 2번째 데이터부터 5개를 가져오라는 의미


3. SUM & AVG
Point I
SUM: 지정한 컬럼들의 값의 총합을 구해주는 내장함수

SELECT SUM(math) FROM grade;
Point II
AVG: 지정한 컬럼들의 평균값을 구해주는 내장함수

SELECT AVG(korean), AVG(english), AVG(math) FROM grade;


4. MAX & MIN
Point I
MAX: 테이블에 존재하는 데이터에서 최댓값을 가져오는 내장함수 (숫자형 뿐만 아니라 문자형도 가능)

SELECT MAX(korean) FROM grade;
Point II
MIN: 테이블에 존재하는 데이터에서 최솟값을 가져오는 내장함수 (숫자형 뿐만 아니라 문자형도 가능)

SELECT MIN(english) FROM grade;